app/views/rentals/_form.html.erb

SELECT "cars".* FROM "cars"
SELECT MAX("cars"."id") FROM "cars"
---
    <%= form.label :car_id %>
    <%= form.collection_select(:car_id, Car.all, :id, :car_name) %>