app/controllers/cars_controller.rb

  def show
   # @car=Car.find(params[:id])
    @car=Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("car_name", "car_id", "car_model", "car_type", "created_at", "updated_at", "car_price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["car_name", "BMWX3"], ["car_id", 8], ["car_model", "BMW"], ["car_type", "C"], ["created_at", "2017-09-26 13:47:19.144773"], ["updated_at", "2017-09-26 13:47:19.144773"], ["car_price", 50.0]]

  def update
    respond_to do |format|
    #  @car=Car.find(params[:id])

      if @car.update(car_params)
---
UPDATE "cars" SET "car_name" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["car_name", "BMW3"], ["updated_at", "2017-09-23 12:44:11.322718"], ["id", 1]]

  def destroy
    @car = Car.find(params[:id])
    @car.destroy
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]