app/controllers/rentals_controller.rb

  def index
    @rentals = @car.rentals.all
---
SELECT "rentals".* FROM "rentals" WHERE "rentals"."car_id" = ?  [["car_id", 1]]

  def edit
    @rental=Rental.find(params[:id])
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @rental = @car.rentals.build(rental_params)

    #current_user.change_current_booking_status
    respond_to do |format|
      if @rental.save

        @car.status = 'RESERVED'
        @car.save

        @user = User.find(@rental.customer_id)
---
INSERT INTO "rentals" ("car_id", "customer_id", "from", "to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["car_id", 1], ["customer_id", 1], ["from", "2017-09-23"], ["to", "2017-09-26"], ["created_at", "2017-09-23 21:46:02.734404"], ["updated_at", "2017-09-23 21:46:02.734404"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rentals".* FROM "rentals" WHERE (car_id = 8 AND ((from <= '2017-09-26 19:00:00' AND to >= '2017-09-26 19:00:00' ) OR (from >= '2017-09-26 19:00:00' AND to <= '2017-09-26 20:00:00') OR (from <= '2017-09-26 20:00:00' AND to >= '2017-09-26 20:00:00')))

  def update
    respond_to do |format|
      if @rental.update(rental_params)
---
UPDATE "rentals" SET "start_time" = ?, "end_time" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["start_time", "2017-09-27 05:00:00"], ["end_time", "2017-09-27 06:00:00"], ["updated_at", "2017-09-27 03:51:58.595941"], ["id", 4]]

  def destroy
    @rental.destroy
---
DELETE FROM "rentals" WHERE "rentals"."id" = ?  [["id", 1]]

    def set_rental
      @rental = Rental.find(params[:id])
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def set_car
    @car = Car.find(params[:car_id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."car_id" = ? LIMIT ?  [["car_id", 3], ["LIMIT", 1]]