app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email_id", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Neeharika"], ["email_id", "neeharikasompalli@gmail.com"], ["phone", "9197201427"], ["created_at", "2017-09-23 21:45:07.752299"], ["updated_at", "2017-09-23 21:45:07.752299"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "age" = ?, "user_type" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 24], ["user_type", "CUSTOMER"], ["updated_at", "2017-09-27 01:55:23.366628"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)