app/views/cars/index.html.erb

        <td><%= car.car_price %></td>
        <%if car.rentals.empty? %>
---
SELECT  1 AS one FROM "rentals" WHERE "rentals"."car_id" = ? LIMIT ?  [["car_id", 1], ["LIMIT", 1]]
SELECT "rentals".* FROM "rentals" WHERE "rentals"."car_id" = ?  [["car_id", 1]]